Revit 2026 API

# FamilyManagerNewType Method

---

Add a new family type with a given name and makes it be the current type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyType NewType(
	string typeName
)
```
```vb
Public Function NewType (
	typeName As String
) As FamilyType
```
```cpp
public:
FamilyType^ NewType(
	String^ typeName
)
```
```fsharp
member NewType :
        typeName : string -> FamilyType
```

#### Parameters

typeName String
    The name of new family type.

#### Return Value

FamilyType

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"typeName"-is . |
| ArgumentException | Thrown when the input argument-"typeName"-is already in use. |
| InvalidOperationException | Thrown when the family type creation failed. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace